FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/АвтомобилиДляТестДрайва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>АвтомобилиДляТестДрайва</Name>
			<Comment>Автомобили для тест-драйва</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МаксимальныйПробег</Name>
					<Comment>Максимальный пробег</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяПродолжительностьЭксплуатации</Name>
					<Comment>Максимальная продолжительность эксплуатации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Comment>Актив</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/АвтомобилиДляТестДрайва/Ext/RecordSetModule.bsl
Перем ДокументОбъект Экспорт;
Перем РезультатЗапросаПоАвтомобилям Экспорт;
Перем ПодразделениеКомпании Экспорт;

Функция ПолучитьТаблицуАвтомобилей(ТаблицаСписания)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтомобилиДляТестДрайваОстатки.ПодразделениеКомпании,
	|	АвтомобилиДляТестДрайваОстатки.Модель,
	|	АвтомобилиДляТестДрайваОстатки.Автомобиль,
	|	АвтомобилиДляТестДрайваОстатки.Актив,
	|	АвтомобилиДляТестДрайваОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.АвтомобилиДляТестДрайва.Остатки КАК АвтомобилиДляТестДрайваОстатки
	|ГДЕ
	|	АвтомобилиДляТестДрайваОстатки.Автомобиль В(&СписокАвто)
	|	И АвтомобилиДляТестДрайваОстатки.Актив В(&СписокАктивов)
	|	И АвтомобилиДляТестДрайваОстатки.Автомобиль <> &ПустойАвтомобиль";
	
	Запрос.УстановитьПараметр("СписокАвто", ТаблицаСписания.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("СписокАктивов", ТаблицаСписания.ВыгрузитьКолонку("ПрочийАктив"));
	Запрос.УстановитьПараметр("ПустойАвтомобиль", Справочники.Автомобили.ПустаяСсылка());
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция Приход() Экспорт
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям = РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из РезультатЗапросаПоАвтомобилям Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.Регистратор 		  = ДокументОбъект.Ссылка;
		НоваяЗапись.Период     			  = ДокументОбъект.Дата;
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Приход;
		НоваяЗапись.ПодразделениеКомпании = ПодразделениеКомпании;
		НоваяЗапись.Модель				  = СтрокаТЧ.Автомобиль.Модель;
		НоваяЗапись.Автомобиль 			  = СтрокаТЧ.Автомобиль;
		НоваяЗапись.Актив                 = СтрокаТЧ.Актив;
		
		НоваяЗапись.Количество            = 1;
		//НоваяЗапись.МаксимальнаяПродолжительностьЭксплуатации = ДобавитьМесяц(ДокументОбъект.Дата,СтрокаТЧ.МаксимальнаяПродолжительностьЭксплуатации);
		НоваяЗапись.МаксимальнаяПродолжительностьЭксплуатации = ДокументОбъект.Дата + (СтрокаТЧ.МаксимальнаяПродолжительностьЭксплуатации *60*60*24);
		НоваяЗапись.МаксимальныйПробег                        = СтрокаТЧ.МаксимальныйПробег;
		НоваяЗапись.ХозОперация                               = ДокументОбъект.ХозОперация;
	КонецЦикла;
КонецФункции

Функция Расход() Экспорт
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям = РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;
	
	ТаблицаОстатковАвто = ПолучитьТаблицуАвтомобилей(РезультатЗапросаПоАвтомобилям);
	
	Для Каждого стрАвто Из РезультатЗапросаПоАвтомобилям Цикл
		
		Если обЗначениеНеЗаполнено(стрАвто.Автомобиль) Тогда
			Продолжить;
		КонецЕсли;
		
		стрПоиска = Новый Структура("Актив,Автомобиль",стрАвто.ПрочийАктив,стрАвто.Автомобиль);
		МассивНайденных = ТаблицаОстатковАвто.НайтиСтроки(стрПоиска);
		
		Для Каждого стрМассива Из МассивНайденных Цикл
			НоваяСтрока = Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрМассива);
			НоваяСтрока.Регистратор = ДокументОбъект.Ссылка;
			НоваяСтрока.Период = ДокументОбъект.Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.ХозОперация = ДокументОбъект.ХозОперация;
		КонецЦикла;
	КонецЦикла;
КонецФункции

Функция Перемещение() Экспорт
	Расход();
	
	ТаблицаСписанныхАвто = ЭтотОбъект.Выгрузить();
	Для Каждого СписанноеАвто Из ТаблицаСписанныхАвто Цикл
		НоваяЗапись = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СписанноеАвто);
		НоваяЗапись.Период      = ДокументОбъект.Дата;
		НоваяЗапись.Регистратор = ДокументОбъект.Ссылка;
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяЗапись.ПодразделениеКомпании = ПодразделениеКомпании;
		НоваяЗапись.ХозОперация = ДокументОбъект.ХозОперация;
	КонецЦикла;
КонецФункции

ДокументОбъект = Неопределено;
РезультатЗапросаПоАвтомобилям = Неопределено;
ПодразделениеКомпании = Неопределено;
